{
  "_name_or_path": "/home/zekaijin/DexVLA/models/Qwen2-VL-2B-Instruct",
  "architectures": [
    "Qwen2VLForConditionalGenerationForVLA"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "concat": "token_cat",
  "eos_token_id": 151645,
  "freeze_vision_tower": false,
  "hidden_act": "silu",
  "hidden_size": 1536,
  "image_token_id": 151655,
  "initializer_range": 0.02,
  "intermediate_size": 8960,
  "llm_loss_weight": 1.0,
  "max_position_embeddings": 32768,
  "max_window_layers": 28,
  "model_type": "qwen2_vla",
  "non_lora_lr": null,
  "num_attention_heads": 12,
  "num_hidden_layers": 28,
  "num_key_value_heads": 2,
  "policy_head_config": {
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cond_dim": 1536,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "depth": 24,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "eos_token_id": null,
    "eval": false,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "input_dim": 14,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "is_tinyvla": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "learn_sigma": false,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "mlp_ratio": 4.0,
    "model_type": "scale_dp_policy",
    "n_emb": 1024,
    "n_obs_steps": 2,
    "no_repeat_ngram_size": 0,
    "noise_samples": 1,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_heads": 16,
    "num_inference_timesteps": 10,
    "num_queries": 50,
    "num_return_sequences": 1,
    "num_train_timesteps": 100,
    "obs_as_cond": true,
    "output_attentions": false,
    "output_dim": 14,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "prediction_horizon": 50,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "state_dim": 14,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "time_as_cond": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torch_dtype": null,
    "torchscript": false,
    "typical_p": 1.0,
    "use_bfloat16": false
  },
  "policy_head_size": "ScaleDP_L",
  "policy_head_type": "scale_dp_policy",
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "mrope_section": [
      16,
      24,
      24
    ],
    "rope_type": "default",
    "type": "default"
  },
  "rope_theta": 1000000.0,
  "sliding_window": 32768,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.2",
  "tune_mm_mlp_adapter": true,
  "use_cache": true,
  "use_sliding_window": false,
  "using_film": true,
  "video_token_id": 151656,
  "vision_config": {
    "hidden_size": 1536,
    "in_chans": 3,
    "model_type": "qwen2_vla",
    "spatial_patch_size": 14
  },
  "vision_end_token_id": 151653,
  "vision_start_token_id": 151652,
  "vision_token_id": 151654,
  "vocab_size": 151936
}
